Art Share API/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES (?, ?)  [["artwork_id", 13], ["viewer_id", 4]]
---
    def create
        @share = ArtworkShare.new(artwork_params)
        if @share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = ?  [["id", 41]]
---
    def destroy
        @share = ArtworkShare.find(params[:id])
        @share.destroy