Art Share API/app/controllers/artworks_controller.rb

    def index
        # debugger
        @artworks = User.find(params[:user_id]).artworks
        @shared_artworks = User.find(params[:user_id]).shared_artworks
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @new_artwork = Artwork.new(artwork_params)
        if @new_artwork.save
---
INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "\"Bellith Charater Reference\""], ["img_url", "\"website.com/imageurl\""], ["artist_id", 1], ["created_at", "2020-04-22 21:26:26.171450"], ["updated_at", "2020-04-22 21:26:26.171450"]]

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = ?, "img_url" = ?, "artist_id" = ?, "updated_at" = ? WHERE "artworks"."id" = ?  [["title", " Apple"], ["img_url", " g.com/122"], ["artist_id", 1], ["updated_at", "2020-04-22 21:37:09.732963"], ["id", 17]]