Art Share API/app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            @comments = Comment.all.where('commenter_id = ?', params[:user_id])
        elsif params[:artwork_id]
            @comments = Comment.all.where('artwork_id = ?', params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE (commenter_id = '3')

    def create
        @comment = Comment.new(comment_params)
        if @comment.save
---
INSERT INTO "comments" ("body", "artwork_id", "commenter_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Don't quit your day job."], ["artwork_id", 20], ["commenter_id", 3], ["created_at", "2020-04-23 18:02:14.651263"], ["updated_at", "2020-04-23 18:02:14.651263"]]