Art Share API/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."liker_id" = ?  [["liker_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        if like_params[:artwork]
            @likes = Artwork.find(like_params[:artwork]).likers
        elsif like_params[:comment]
            @likes = Comment.find(like_params[:comment]).likers
        elsif like_params[:user]
            @user = User.find(like_params[:user])

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 4]]
---
    def destroy
        @like = Like.find(params[:id])
        @like.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "likes" ("liker_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["liker_id", 3], ["likeable_type", "Artwork"], ["likeable_id", 18], ["created_at", "2020-04-23 20:14:31.555479"], ["updated_at", "2020-04-23 20:14:31.555479"]]
---
    def create
        if params[:artwork_id]
            @like = Artwork.find(params[:artwork_id]).likes.new(liker_id: like_params[:user])
        elsif params[:comment_id]
            @like = Comment.find(params[:comment_id]).likes.new(liker_id: like_params[:user])
        end

        if @like.save