Art Share API/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%'mmcnulty'%')
---
    def index
        if params[:name]
            @users = User.where("username LIKE ?", "%#{params[:name]}%")
        else
            @users = User.all

INSERT INTO "users" ("name", "email") VALUES (?, ?)  [["name", "'henry'"], ["email", "'lucas@gmail.com'"]]
---
    def create
        # render json: params
        user = User.new(user_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = ? WHERE "users"."id" = ?  [["username", "just_another_user"], ["id", 2]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)